Autodesk.Revit.DB.FilterNumericValueRule.SetEvaluator(Autodesk.Revit.DB.FilterNumericRuleEvaluator)
Sets the evaluator that implements the test for this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterNumericValueRule.GetEvaluator
Gets the evaluator that implements the test for this rule.
Since:
2011

Autodesk.Revit.DB.FilterNumericValueRule
Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons
Since:
2011